Tekla Open API Reference for Tekla Structures 2025
IEvents.Interrupted Event
 Occurs when user interrupts.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.InterruptedDelegate Interrupted
Event Interrupted As Events.InterruptedDelegate
Value
Type: Tekla.Structures.Model.Events.InterruptedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace